backend/views/layouts/main.php

SELECT * FROM `user` WHERE `id`=2
---
    	$menuItems[] = ['label' => 'Estudiantes', 'url' => ['/datos']];
    	$menuItems[] = ['label' => 'Libros', 'url' => ['/stock']];

    	if (User::findOne(Yii::$app->user->id)->Rango(['0'])){   //el rango cero es el admin