common/models/Config.php

SELECT * FROM `configuracion` WHERE `cod`='DirWeb'
---
		public function Valor(){
			$cod=$this->conf;
			$model = Configuracion::findOne($cod);