backend/modules/gestionuser/controllers/UsersController.php

SELECT * FROM `user` WHERE `id`='15'
DELETE FROM `user` WHERE `id`=15
---
    public function actionEliminausr(){
		$id=$_REQUEST["id"];
    	if(Yii::$app->user->id!=$id){
    		$model = User::findOne($id);
			$model->delete();