backend/modules/gestiondatos/controllers/InfoController.php

INSERT INTO `DatosUser` (`NombreyApellido`, `DNI`, `Email`, `Telefono`) VALUES ('zxzx', 'zxzx', 'zxzx@gmail.com', 'zxzx')
---
    public function actionNuevo()
    {
        $model = new datosuser();

        $model->NombreyApellido=urldecode($_REQUEST["NombreyApellido"]);
        $model->DNI=urldecode($_REQUEST["DNI"]);
		  $model->Email=urldecode($_REQUEST["Email"]);
		  $model->Telefono=urldecode($_REQUEST["Telefono"]);
        $model->save();