backend/modules/gestiondatos/controllers/InfoController.php

UPDATE `DatosUser` SET `Suspendido`=1 WHERE `IdUser`=1
---
	public function actionSuspend()
	{
		//carga de parametros
		$Estud=urldecode($_REQUEST["id"]);
		//buscamos el estudiante y definimos suspensión en "1", más adelante se podria establecer la suspensión de más de un usuario
		$model=datosuser::findOne($Estud);
		$model->Suspendido=urldecode($_REQUEST["v"]);
		if ($model->Suspendido==1){$s=1;}else{$s=3;}
		$model->save(false);