backend/modules/config/widgets/ControlesConf.php

    public function run()
    {
    	$Html='';
    	//recorremos los registros de la tabla de configuraciones y creamos los controles
    	$Consulta=(new \yii\db\Query())->select('*')->from('configuracion')->all();
---
SELECT * FROM `configuracion`