backend/modules/gestionstock/controllers/StockController.php

SELECT * FROM `user` WHERE `id`=2
---
    public function actionIndex()
    {
        $Config=new Config(['conf'=>'DirWeb']);
		$Rweb=$Config->Valor();
			$rango=User::findOne(Yii::$app->user->id)->Rango(['0']);

INSERT INTO `Stock` (`Codigo`, `Nombre`, `Descripcion`, `Autor`, `Cantidad`, `CantidadDisponible`) VALUES ('sdfsfw45', 'Química Biológica', 'Metabolismo y la cuestión química, nunca antes mejor explicada', 'Athur Fracis', 200, 30)
---
	public function actionNuevolib(){

		$No=urldecode($_REQUEST['Nombre']);
		$Ds=urldecode($_REQUEST["Descripcion"]);
		$Au=urldecode($_REQUEST["Autor"]);
		$Ca=urldecode($_REQUEST["Cantidad"]);
		//verificamos que se hayan completado todos los campos
		if ($No!='' && $Ds!='' && $Au!='' && $Ca!=''){
			$model = new stock();
      	$model->Nombre=$No;
      	$model->Descripcion=$Ds;
			$model->Autor=$Au;
			$model->Cantidad=$Ca;
			$model->CantidadDisponible=$model->Cantidad;
      	if($model->save()){ //si se puede guardar el registro