backend/modules/gestionstock/views/prestamos/index.php

        			return $Estudiante->NombreyApellido;
        		},
			],
    		[
    			'attribute' => 'IdStock',//reemplazar
        		'label' => 'Libro',
        		'value' => function($model){
        			$Libro = stock::findOne($model->IdStock);
        			return $Libro->Nombre;
        		},
    		],
---
SELECT * FROM `Stock` WHERE `idStock`=10